main_list = [7, 4, 98, 65, 22, 86, 12, 39, 27, 16, 'cat', 'dog', 'rabbit', 'lion', 'tiger', 'bear', 'wolf', 'fox', 'horse', 'monkey']
# Ініціалізуємо список data, який містить як числа (int), так і рядки (str)
ints = sorted(x for x in main_list if type(x) is int)
# Створюємо список ints, який містить усі цілі числа зі списку data, відсортовані за зростанням. Використовується генератор з перевіркою type(x) is int
strs = sorted(x for x in main_list if type(x) is str)
# Створюємо список strs, який містить усі рядкові елементи зі списку data, відсортовані в алфавітному порядку. Перевірка type(x) is str
list = ints + strs
# Об'єднуємо два відсортованих списки ints і strs у один список list, де спочатку йдуть числа, потім рядки
even_numbers = [x for x in ints if x % 2 == 0]
# Створюємо список even_numbers, який містить лише парні числа серед елементів списку ints. Відбираємо числа, кратні двом
caps = [x.upper() for x in strs]
# Створюємо список caps, де кожен рядковий елемент зі списку strs перетворений у великі літери за допомогою методу upper()
print('Основний список :', main_list)
# Виводимо на екран основний список
print('Відсортований список : ',list)
# Виводимо на екран об'єднаний відсортований список list
print('Парні числа: ', even_numbers)
# Виводимо список even_numbers з парними числами зі списку ints
print('Капсом: ', caps)
# Виводимо список caps — рядки у верхньому регістрі