from decorator import log_exceptions

@log_exceptions  # Застосовує декоратор, щоб відловлювати та логувати помилки у функції divide
def divide(a, b):
    return a / b  # Виконує ділення a на b—тут може виникнути помилка ділення на нуль

def main():
    divide(5, 0)  # Викликає функцію з аргументами, які викликають помилку (ділення на 0)

if __name__ == '__main__':  # Перевіряє, що скрипт запускається напряму, а не імпортується
    main()  # Виконує головну функцію, запускаючи код із перевіркою
